blake-mh-liu/ADCU_TC387/tresos/plugins/MicroOs_TS_T16D27M2I0R0/include/public/TRICORE/Mk_TC38X.h
/* Mk_TC38X.h - Description of Tricore (AURIX) variant TC38X
 *
 * Description of common properties of all Aurix TC38X derivatives.
 *
 * (c) Elektrobit Automotive GmbH
*/

#ifndef MK_TC38X_H
#define MK_TC38X_H

/* All SRC registers as defined by AutoCore OS */

/* Service request nodes (interrupt source registers) on the TC38XT
 * and TC38XQ.
 * They are based between F0038000 and F0039FFF.
*/

/* SRC registers according to AURIX TC38x Target Specification V2.5.1.
*/

#define MK_SRCBASE MK_U(0xf0038000)

#define MK_SRC_CPU0SB       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0000)))
#define MK_SRC_CPU1SB       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0004)))
#define MK_SRC_CPU2SB       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0008)))
#define MK_SRC_CPU3SB       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x000C)))
/* 0x10 to 0x1c are undocumented */
#define MK_SRC_BCUSPB       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0020)))
/* 0x24 to 0x2c are undocumented */
#define MK_SRC_XBAR0        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0030)))
/* 0x34 to 0x3c are undocumented */
#define MK_SRC_CERBERUS0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0040)))
#define MK_SRC_CERBERUS1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0044)))
/* 0x48 to 0x4c are undocumented */
#define MK_SRC_ASCLIN0TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0050)))
#define MK_SRC_ASCLIN0RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0054)))
#define MK_SRC_ASCLIN0ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0058)))
#define MK_SRC_ASCLIN1TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x005C)))
#define MK_SRC_ASCLIN1RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0060)))
#define MK_SRC_ASCLIN1ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0064)))
#define MK_SRC_ASCLIN2TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0068)))
#define MK_SRC_ASCLIN2RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x006C)))
#define MK_SRC_ASCLIN2ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0070)))
#define MK_SRC_ASCLIN3TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0074)))
#define MK_SRC_ASCLIN3RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0078)))
#define MK_SRC_ASCLIN3ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x007C)))
#define MK_SRC_ASCLIN4TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0080)))
#define MK_SRC_ASCLIN4RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0084)))
#define MK_SRC_ASCLIN4ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0088)))
#define MK_SRC_ASCLIN5TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x008C)))
#define MK_SRC_ASCLIN5RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0090)))
#define MK_SRC_ASCLIN5ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0094)))
#define MK_SRC_ASCLIN6TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0098)))
#define MK_SRC_ASCLIN6RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x009C)))
#define MK_SRC_ASCLIN6ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00A0)))
#define MK_SRC_ASCLIN7TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00A4)))
#define MK_SRC_ASCLIN7RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00A8)))
#define MK_SRC_ASCLIN7ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00AC)))
#define MK_SRC_ASCLIN8TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00B0)))
#define MK_SRC_ASCLIN8RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00B4)))
#define MK_SRC_ASCLIN8ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00B8)))
#define MK_SRC_ASCLIN9TX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00BC)))
#define MK_SRC_ASCLIN9RX    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00C0)))
#define MK_SRC_ASCLIN9ERR   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00C4)))
#define MK_SRC_ASCLIN10TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00C8)))
#define MK_SRC_ASCLIN10RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00CC)))
#define MK_SRC_ASCLIN10ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00D0)))
#define MK_SRC_ASCLIN11TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00D4)))
#define MK_SRC_ASCLIN11RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00D8)))
#define MK_SRC_ASCLIN11ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00DC)))
/* 0xe0 to 0xe8 are undocumented */
#define MK_SRC_MTUDONE      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00EC)))
#define MK_SRC_QSPI0TX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00F0)))
#define MK_SRC_QSPI0RX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00F4)))
#define MK_SRC_QSPI0ERR     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00F8)))
#define MK_SRC_QSPI0PT      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x00FC)))
#define MK_SRC_QSPI0U       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0100)))
#define MK_SRC_QSPI1TX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0104)))
#define MK_SRC_QSPI1RX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0108)))
#define MK_SRC_QSPI1ERR     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x010C)))
#define MK_SRC_QSPI1PT      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0110)))
#define MK_SRC_QSPI1U       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0114)))
#define MK_SRC_QSPI2TX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0118)))
#define MK_SRC_QSPI2RX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x011C)))
#define MK_SRC_QSPI2ERR     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0120)))
#define MK_SRC_QSPI2PT      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0124)))
#define MK_SRC_QSPI2U       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0128)))
#define MK_SRC_QSPI3TX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x012C)))
#define MK_SRC_QSPI3RX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0130)))
#define MK_SRC_QSPI3ERR     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0134)))
#define MK_SRC_QSPI3PT      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0138)))
#define MK_SRC_QSPI3U       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x013C)))
#define MK_SRC_QSPI4TX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0140)))
#define MK_SRC_QSPI4RX      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0144)))
#define MK_SRC_QSPI4ERR     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0148)))
#define MK_SRC_QSPI4PT      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x014C)))
#define MK_SRC_QSPI4U       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0150)))
/* 0x154 to 0x17c are undocumented */
#define MK_SRC_HSCT0        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0180)))
/* 0x184 to 0x18c are undocumented */
#define MK_SRC_HSSL0COK0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0190)))
#define MK_SRC_HSSL0RDI0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0194)))
#define MK_SRC_HSSL0ERR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0198)))
#define MK_SRC_HSSL0TRG0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x019C)))
#define MK_SRC_HSSL0COK1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01A0)))
#define MK_SRC_HSSL0RDI1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01A4)))
#define MK_SRC_HSSL0ERR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01A8)))
#define MK_SRC_HSSL0TRG1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01AC)))
#define MK_SRC_HSSL0COK2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01B0)))
#define MK_SRC_HSSL0RDI2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01B4)))
#define MK_SRC_HSSL0ERR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01B8)))
#define MK_SRC_HSSL0TRG2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01BC)))
#define MK_SRC_HSSL0COK3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01C0)))
#define MK_SRC_HSSL0RDI3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01C4)))
#define MK_SRC_HSSL0ERR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01C8)))
#define MK_SRC_HSSL0TRG3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01CC)))
#define MK_SRC_HSSL0EXI     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x01D0)))
/* 0x01d4 to 0x21c are undocumented */
#define MK_SRC_I2C0DTR      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0220)))
#define MK_SRC_I2C0ERR      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0224)))
#define MK_SRC_I2C0P        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0228)))
/* 0x022c is undocumented */
#define MK_SRC_I2C1DTR      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0230)))
#define MK_SRC_I2C1ERR      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0234)))
#define MK_SRC_I2C1P        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0238)))
/* 0x023c is undocumented */
#define MK_SRC_SENT0        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0240)))
#define MK_SRC_SENT1        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0244)))
#define MK_SRC_SENT2        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0248)))
#define MK_SRC_SENT3        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x024C)))
#define MK_SRC_SENT4        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0250)))
#define MK_SRC_SENT5        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0254)))
#define MK_SRC_SENT6        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0258)))
#define MK_SRC_SENT7        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x025C)))
#define MK_SRC_SENT8        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0260)))
#define MK_SRC_SENT9        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0264)))
/* 0x0268 to 0x026c are undocumented */
#define MK_SRC_MSC0SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0270)))
#define MK_SRC_MSC0SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0274)))
#define MK_SRC_MSC0SR2      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0278)))
#define MK_SRC_MSC0SR3      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x027C)))
#define MK_SRC_MSC0SR4      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0280)))
#define MK_SRC_MSC1SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0284)))
#define MK_SRC_MSC1SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0288)))
#define MK_SRC_MSC1SR2      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x028C)))
#define MK_SRC_MSC1SR3      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0290)))
#define MK_SRC_MSC1SR4      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0294)))
#define MK_SRC_MSC2SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0298)))
#define MK_SRC_MSC2SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x029C)))
#define MK_SRC_MSC2SR2      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02A0)))
#define MK_SRC_MSC2SR3      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02A4)))
#define MK_SRC_MSC2SR4      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02A8)))
/* 0x02ac to 0x02bc are undocumented */
#define MK_SRC_CCU60SR0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02C0)))
#define MK_SRC_CCU60SR1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02C4)))
#define MK_SRC_CCU60SR2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02C8)))
#define MK_SRC_CCU60SR3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02CC)))
#define MK_SRC_CCU61SR0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02D0)))
#define MK_SRC_CCU61SR1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02D4)))
#define MK_SRC_CCU61SR2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02D8)))
#define MK_SRC_CCU61SR3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02DC)))
#define MK_SRC_GPT120CIRQ   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02E0)))
#define MK_SRC_GPT120T2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02E4)))
#define MK_SRC_GPT120T3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02E8)))
#define MK_SRC_GPT120T4     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02EC)))
#define MK_SRC_GPT120T5     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02F0)))
#define MK_SRC_GPT120T6     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x02F4)))
/* 0x02f8 to 0x02fc are undocumented */
#define MK_SRC_STM0SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0300)))
#define MK_SRC_STM0SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0304)))
#define MK_SRC_STM1SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0308)))
#define MK_SRC_STM1SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x030C)))
#define MK_SRC_STM2SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0310)))
#define MK_SRC_STM2SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0314)))
#define MK_SRC_STM3SR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0318)))
#define MK_SRC_STM3SR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x031C)))
/* 0x0320 to 0x032c are undocumented */
#define MK_SRC_FCE0         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0330)))
/* 0x0334 to 0x033c are undocumented */
#define MK_SRC_DMAERR0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0340)))
#define MK_SRC_DMAERR1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0344)))
#define MK_SRC_DMAERR2      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0348)))
#define MK_SRC_DMAERR3      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x034C)))
/* 0x0350 to 0x036c are undocumented */
#define MK_SRC_DMACH0       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0370)))
#define MK_SRC_DMACH1       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0374)))
#define MK_SRC_DMACH2       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0378)))
#define MK_SRC_DMACH3       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x037C)))
#define MK_SRC_DMACH4       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0380)))
#define MK_SRC_DMACH5       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0384)))
#define MK_SRC_DMACH6       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0388)))
#define MK_SRC_DMACH7       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x038C)))
#define MK_SRC_DMACH8       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0390)))
#define MK_SRC_DMACH9       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0394)))
#define MK_SRC_DMACH10      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0398)))
#define MK_SRC_DMACH11      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x039C)))
#define MK_SRC_DMACH12      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03A0)))
#define MK_SRC_DMACH13      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03A4)))
#define MK_SRC_DMACH14      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03A8)))
#define MK_SRC_DMACH15      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03AC)))
#define MK_SRC_DMACH16      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03B0)))
#define MK_SRC_DMACH17      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03B4)))
#define MK_SRC_DMACH18      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03B8)))
#define MK_SRC_DMACH19      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03BC)))
#define MK_SRC_DMACH20      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03C0)))
#define MK_SRC_DMACH21      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03C4)))
#define MK_SRC_DMACH22      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03C8)))
#define MK_SRC_DMACH23      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03CC)))
#define MK_SRC_DMACH24      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03D0)))
#define MK_SRC_DMACH25      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03D4)))
#define MK_SRC_DMACH26      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03D8)))
#define MK_SRC_DMACH27      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03DC)))
#define MK_SRC_DMACH28      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03E0)))
#define MK_SRC_DMACH29      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03E4)))
#define MK_SRC_DMACH30      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03E8)))
#define MK_SRC_DMACH31      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03EC)))
#define MK_SRC_DMACH32      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03F0)))
#define MK_SRC_DMACH33      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03F4)))
#define MK_SRC_DMACH34      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03F8)))
#define MK_SRC_DMACH35      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x03FC)))
#define MK_SRC_DMACH36      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0400)))
#define MK_SRC_DMACH37      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0404)))
#define MK_SRC_DMACH38      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0408)))
#define MK_SRC_DMACH39      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x040C)))
#define MK_SRC_DMACH40      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0410)))
#define MK_SRC_DMACH41      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0414)))
#define MK_SRC_DMACH42      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0418)))
#define MK_SRC_DMACH43      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x041C)))
#define MK_SRC_DMACH44      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0420)))
#define MK_SRC_DMACH45      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0424)))
#define MK_SRC_DMACH46      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0428)))
#define MK_SRC_DMACH47      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x042C)))
#define MK_SRC_DMACH48      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0430)))
#define MK_SRC_DMACH49      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0434)))
#define MK_SRC_DMACH50      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0438)))
#define MK_SRC_DMACH51      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x043C)))
#define MK_SRC_DMACH52      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0440)))
#define MK_SRC_DMACH53      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0444)))
#define MK_SRC_DMACH54      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0448)))
#define MK_SRC_DMACH55      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x044C)))
#define MK_SRC_DMACH56      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0450)))
#define MK_SRC_DMACH57      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0454)))
#define MK_SRC_DMACH58      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0458)))
#define MK_SRC_DMACH59      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x045C)))
#define MK_SRC_DMACH60      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0460)))
#define MK_SRC_DMACH61      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0464)))
#define MK_SRC_DMACH62      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0468)))
#define MK_SRC_DMACH63      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x046C)))
#define MK_SRC_DMACH64      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0470)))
#define MK_SRC_DMACH65      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0474)))
#define MK_SRC_DMACH66      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0478)))
#define MK_SRC_DMACH67      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x047C)))
#define MK_SRC_DMACH68      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0480)))
#define MK_SRC_DMACH69      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0484)))
#define MK_SRC_DMACH70      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0488)))
#define MK_SRC_DMACH71      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x048C)))
#define MK_SRC_DMACH72      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0490)))
#define MK_SRC_DMACH73      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0494)))
#define MK_SRC_DMACH74      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0498)))
#define MK_SRC_DMACH75      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x049C)))
#define MK_SRC_DMACH76      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04A0)))
#define MK_SRC_DMACH77      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04A4)))
#define MK_SRC_DMACH78      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04A8)))
#define MK_SRC_DMACH79      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04AC)))
#define MK_SRC_DMACH80      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04B0)))
#define MK_SRC_DMACH81      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04B4)))
#define MK_SRC_DMACH82      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04B8)))
#define MK_SRC_DMACH83      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04BC)))
#define MK_SRC_DMACH84      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04C0)))
#define MK_SRC_DMACH85      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04C4)))
#define MK_SRC_DMACH86      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04C8)))
#define MK_SRC_DMACH87      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04CC)))
#define MK_SRC_DMACH88      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04D0)))
#define MK_SRC_DMACH89      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04D4)))
#define MK_SRC_DMACH90      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04D8)))
#define MK_SRC_DMACH91      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04DC)))
#define MK_SRC_DMACH92      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04E0)))
#define MK_SRC_DMACH93      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04E4)))
#define MK_SRC_DMACH94      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04E8)))
#define MK_SRC_DMACH95      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04EC)))
#define MK_SRC_DMACH96      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04F0)))
#define MK_SRC_DMACH97      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04F4)))
#define MK_SRC_DMACH98      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04F8)))
#define MK_SRC_DMACH99      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x04FC)))
#define MK_SRC_DMACH100     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0500)))
#define MK_SRC_DMACH101     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0504)))
#define MK_SRC_DMACH102     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0508)))
#define MK_SRC_DMACH103     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x050C)))
#define MK_SRC_DMACH104     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0510)))
#define MK_SRC_DMACH105     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0514)))
#define MK_SRC_DMACH106     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0518)))
#define MK_SRC_DMACH107     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x051C)))
#define MK_SRC_DMACH108     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0520)))
#define MK_SRC_DMACH109     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0524)))
#define MK_SRC_DMACH110     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0528)))
#define MK_SRC_DMACH111     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x052C)))
#define MK_SRC_DMACH112     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0530)))
#define MK_SRC_DMACH113     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0534)))
#define MK_SRC_DMACH114     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0538)))
#define MK_SRC_DMACH115     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x053C)))
#define MK_SRC_DMACH116     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0540)))
#define MK_SRC_DMACH117     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0544)))
#define MK_SRC_DMACH118     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0548)))
#define MK_SRC_DMACH119     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x054C)))
#define MK_SRC_DMACH120     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0550)))
#define MK_SRC_DMACH121     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0554)))
#define MK_SRC_DMACH122     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0558)))
#define MK_SRC_DMACH123     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x055C)))
#define MK_SRC_DMACH124     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0560)))
#define MK_SRC_DMACH125     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0564)))
#define MK_SRC_DMACH126     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0568)))
#define MK_SRC_DMACH127     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x056C)))
/* 0x0570 to 0x057c are undocumented */
#define MK_SRC_GETH0        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0580)))
#define MK_SRC_GETH1        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0584)))
#define MK_SRC_GETH2        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0588)))
#define MK_SRC_GETH3        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x058C)))
#define MK_SRC_GETH4        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0590)))
#define MK_SRC_GETH5        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0594)))
#define MK_SRC_GETH6        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0598)))
#define MK_SRC_GETH7        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x059C)))
#define MK_SRC_GETH8        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05A0)))
#define MK_SRC_GETH9        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05A4)))
/* 0x05a8 to 0x5ac are undocumented */
#define MK_SRC_CAN0INT0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05B0)))
#define MK_SRC_CAN0INT1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05B4)))
#define MK_SRC_CAN0INT2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05B8)))
#define MK_SRC_CAN0INT3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05BC)))
#define MK_SRC_CAN0INT4     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05C0)))
#define MK_SRC_CAN0INT5     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05C4)))
#define MK_SRC_CAN0INT6     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05C8)))
#define MK_SRC_CAN0INT7     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05CC)))
#define MK_SRC_CAN0INT8     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05D0)))
#define MK_SRC_CAN0INT9     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05D4)))
#define MK_SRC_CAN0INT10    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05D8)))
#define MK_SRC_CAN0INT11    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05DC)))
#define MK_SRC_CAN0INT12    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05E0)))
#define MK_SRC_CAN0INT13    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05E4)))
#define MK_SRC_CAN0INT14    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05E8)))
#define MK_SRC_CAN0INT15    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05EC)))
#define MK_SRC_CAN1INT0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05F0)))
#define MK_SRC_CAN1INT1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05F4)))
#define MK_SRC_CAN1INT2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05F8)))
#define MK_SRC_CAN1INT3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x05FC)))
#define MK_SRC_CAN1INT4     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0600)))
#define MK_SRC_CAN1INT5     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0604)))
#define MK_SRC_CAN1INT6     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0608)))
#define MK_SRC_CAN1INT7     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x060C)))
#define MK_SRC_CAN1INT8     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0610)))
#define MK_SRC_CAN1INT9     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0614)))
#define MK_SRC_CAN1INT10    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0618)))
#define MK_SRC_CAN1INT11    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x061C)))
#define MK_SRC_CAN1INT12    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0620)))
#define MK_SRC_CAN1INT13    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0624)))
#define MK_SRC_CAN1INT14    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0628)))
#define MK_SRC_CAN1INT15    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x062C)))
#define MK_SRC_CAN2INT0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0630)))
#define MK_SRC_CAN2INT1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0634)))
#define MK_SRC_CAN2INT2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0638)))
#define MK_SRC_CAN2INT3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x063C)))
#define MK_SRC_CAN2INT4     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0640)))
#define MK_SRC_CAN2INT5     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0644)))
#define MK_SRC_CAN2INT6     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0648)))
#define MK_SRC_CAN2INT7     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x064C)))
#define MK_SRC_CAN2INT8     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0650)))
