blake-mh-liu/ADCU_TC387/tresos/plugins/MicroOs_TS_T16D27M2I0R0/include/public/TRICORE/Mk_TC38X.h
#define MK_SRC_CAN2INT9     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0654)))
#define MK_SRC_CAN2INT10    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0658)))
#define MK_SRC_CAN2INT11    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x065C)))
#define MK_SRC_CAN2INT12    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0660)))
#define MK_SRC_CAN2INT13    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0664)))
#define MK_SRC_CAN2INT14    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0668)))
#define MK_SRC_CAN2INT15    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x066C)))
#define MK_SRC_VADCG0SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0670)))
#define MK_SRC_VADCG0SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0674)))
#define MK_SRC_VADCG0SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0678)))
#define MK_SRC_VADCG0SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x067C)))
#define MK_SRC_VADCG1SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0680)))
#define MK_SRC_VADCG1SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0684)))
#define MK_SRC_VADCG1SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0688)))
#define MK_SRC_VADCG1SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x068C)))
#define MK_SRC_VADCG2SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0690)))
#define MK_SRC_VADCG2SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0694)))
#define MK_SRC_VADCG2SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0698)))
#define MK_SRC_VADCG2SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x069C)))
#define MK_SRC_VADCG3SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06A0)))
#define MK_SRC_VADCG3SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06A4)))
#define MK_SRC_VADCG3SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06A8)))
#define MK_SRC_VADCG3SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06AC)))
#define MK_SRC_VADCG4SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06B0)))
#define MK_SRC_VADCG4SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06B4)))
#define MK_SRC_VADCG4SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06B8)))
#define MK_SRC_VADCG4SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06BC)))
#define MK_SRC_VADCG5SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06C0)))
#define MK_SRC_VADCG5SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06C4)))
#define MK_SRC_VADCG5SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06C8)))
#define MK_SRC_VADCG5SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06CC)))
#define MK_SRC_VADCG6SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06D0)))
#define MK_SRC_VADCG6SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06D4)))
#define MK_SRC_VADCG6SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06D8)))
#define MK_SRC_VADCG6SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06DC)))
#define MK_SRC_VADCG7SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06E0)))
#define MK_SRC_VADCG7SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06E4)))
#define MK_SRC_VADCG7SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06E8)))
#define MK_SRC_VADCG7SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06EC)))
#define MK_SRC_VADCG8SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06F0)))
#define MK_SRC_VADCG8SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06F4)))
#define MK_SRC_VADCG8SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06F8)))
#define MK_SRC_VADCG8SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x06FC)))
#define MK_SRC_VADCG9SR0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0700)))
#define MK_SRC_VADCG9SR1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0704)))
#define MK_SRC_VADCG9SR2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0708)))
#define MK_SRC_VADCG9SR3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x070C)))
#define MK_SRC_VADCG10SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0710)))
#define MK_SRC_VADCG10SR1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0714)))
#define MK_SRC_VADCG10SR2   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0718)))
#define MK_SRC_VADCG10SR3   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x071C)))
#define MK_SRC_VADCG11SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0720)))
#define MK_SRC_VADCG11SR1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0724)))
#define MK_SRC_VADCG11SR2   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0728)))
#define MK_SRC_VADCG11SR3   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x072C)))
#define MK_SRC_VADCFC0SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0730)))
#define MK_SRC_VADCFC1SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0734)))
#define MK_SRC_VADCFC2SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0738)))
#define MK_SRC_VADCFC3SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x073C)))
/* 0x0740 to 0x074c are undocumented */
#define MK_SRC_VADCCG0SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0750)))
#define MK_SRC_VADCCG0SR1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0754)))
#define MK_SRC_VADCCG0SR2   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0758)))
#define MK_SRC_VADCCG0SR3   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x075C)))
#define MK_SRC_VADCCG1SR0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0760)))
#define MK_SRC_VADCCG1SR1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0764)))
#define MK_SRC_VADCCG1SR2   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0768)))
#define MK_SRC_VADCCG1SR3   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x076C)))
#define MK_SRC_DSADCSRM0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0770)))
#define MK_SRC_DSADCSRA0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0774)))
#define MK_SRC_DSADCSRM1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0778)))
#define MK_SRC_DSADCSRA1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x077C)))
#define MK_SRC_DSADCSRM2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0780)))
#define MK_SRC_DSADCSRA2    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0784)))
#define MK_SRC_DSADCSRM3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0788)))
#define MK_SRC_DSADCSRA3    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x078C)))
#define MK_SRC_DSADCSRM4    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0790)))
#define MK_SRC_DSADCSRA4    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0794)))
#define MK_SRC_DSADCSRM5    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0798)))
#define MK_SRC_DSADCSRA5    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x079C)))
#define MK_SRC_DSADCSRM6    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07A0)))
#define MK_SRC_DSADCSRA6    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07A4)))
#define MK_SRC_DSADCSRM7    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07A8)))
#define MK_SRC_DSADCSRA7    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07AC)))
#define MK_SRC_DSADCSRM8    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07B0)))
#define MK_SRC_DSADCSRA8    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07B4)))
#define MK_SRC_DSADCSRM9    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07B8)))
#define MK_SRC_DSADCSRA9    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07BC)))
/* 0x07c0 to 0x07dc are undocumented */
#define MK_SRC_ASCLIN12TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07E0)))
#define MK_SRC_ASCLIN12RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07E4)))
#define MK_SRC_ASCLIN12ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07E8)))
#define MK_SRC_ASCLIN13TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07EC)))
#define MK_SRC_ASCLIN13RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07F0)))
#define MK_SRC_ASCLIN13ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x07F4)))
/* 0x07f8 to 0x07fc are undocumented */
#define MK_SRC_ERAY0INT0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0800)))
#define MK_SRC_ERAY0INT1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0804)))
#define MK_SRC_ERAY0TINT0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0808)))
#define MK_SRC_ERAY0TINT1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x080C)))
#define MK_SRC_ERAY0NDAT0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0810)))
#define MK_SRC_ERAY0NDAT1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0814)))
#define MK_SRC_ERAY0MBSC0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0818)))
#define MK_SRC_ERAY0MBSC1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x081C)))
#define MK_SRC_ERAY0OBUSY   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0820)))
#define MK_SRC_ERAY0IBUSY   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0824)))
/* 0x0828 to 0x082c are undocumented */
#define MK_SRC_ERAY1INT0    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0830)))
#define MK_SRC_ERAY1INT1    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0834)))
#define MK_SRC_ERAY1TINT0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0838)))
#define MK_SRC_ERAY1TINT1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x083C)))
#define MK_SRC_ERAY1NDAT0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0840)))
#define MK_SRC_ERAY1NDAT1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0844)))
#define MK_SRC_ERAY1MBSC0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0848)))
#define MK_SRC_ERAY1MBSC1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x084C)))
#define MK_SRC_ERAY1OBUSY   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0850)))
#define MK_SRC_ERAY1IBUSY   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0854)))
/* 0x0858 to 0x085c are undocumented */
#define MK_SRC_DMUHOST      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0860)))
#define MK_SRC_DMUFSI       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0864)))
/* 0x0868 to 0x086c are undocumented */
#define MK_SRC_HSM0         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0870)))
#define MK_SRC_HSM1         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0874)))
/* 0x0878 to 0x087c are undocumented */
#define MK_SRC_SCUERU0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0880)))
#define MK_SRC_SCUERU1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0884)))
#define MK_SRC_SCUERU2      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0888)))
#define MK_SRC_SCUERU3      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x088C)))
/* 0x0890 to 0x08a8 are undocumented */
#define MK_SRC_PMSDTS       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08AC)))
#define MK_SRC_PMS0         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08B0)))
#define MK_SRC_PMS1         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08B4)))
#define MK_SRC_PMS2         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08B8)))
#define MK_SRC_PMS3         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08BC)))
#define MK_SRC_SCR          ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08C0)))
/* 0x08c4 to 0x08cc are undocumented */
#define MK_SRC_SMU0         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08D0)))
#define MK_SRC_SMU1         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08D4)))
#define MK_SRC_SMU2         ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08D8)))
/* 0x08dc is undocumented */
#define MK_SRC_PSI50        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08E0)))
#define MK_SRC_PSI51        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08E4)))
#define MK_SRC_PSI52        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08E8)))
#define MK_SRC_PSI53        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08EC)))
#define MK_SRC_PSI54        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08F0)))
#define MK_SRC_PSI55        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08F4)))
#define MK_SRC_PSI56        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08F8)))
#define MK_SRC_PSI57        ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x08FC)))
/* 0x0900 to 0x090c are undocumented */
#define MK_SRC_DAM0LI0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0910)))
#define MK_SRC_DAM0RI0      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0914)))
#define MK_SRC_DAM0LI1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0918)))
#define MK_SRC_DAM0RI1      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x091C)))
#define MK_SRC_DAM0DR       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0920)))
#define MK_SRC_DAM0ERR      ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0924)))
/* 0x0928 to 0x094c are undocumented */
#define MK_SRC_PSI5S0       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0950)))
#define MK_SRC_PSI5S1       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0954)))
#define MK_SRC_PSI5S2       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0958)))
#define MK_SRC_PSI5S3       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x095C)))
#define MK_SRC_PSI5S4       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0960)))
#define MK_SRC_PSI5S5       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0964)))
#define MK_SRC_PSI5S6       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0968)))
#define MK_SRC_PSI5S7       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x096C)))
/* 0x0970 to 0x098c are undocumented */
#define MK_SRC_GPSR00       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0990)))
#define MK_SRC_GPSR01       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0994)))
#define MK_SRC_GPSR02       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0998)))
#define MK_SRC_GPSR03       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x099C)))
#define MK_SRC_GPSR04       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09A0)))
#define MK_SRC_GPSR05       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09A4)))
#define MK_SRC_GPSR06       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09A8)))
#define MK_SRC_GPSR07       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09AC)))
#define MK_SRC_GPSR10       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09B0)))
#define MK_SRC_GPSR11       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09B4)))
#define MK_SRC_GPSR12       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09B8)))
#define MK_SRC_GPSR13       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09BC)))
#define MK_SRC_GPSR14       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09C0)))
#define MK_SRC_GPSR15       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09C4)))
#define MK_SRC_GPSR16       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09C8)))
#define MK_SRC_GPSR17       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09CC)))
#define MK_SRC_GPSR20       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09D0)))
#define MK_SRC_GPSR21       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09D4)))
#define MK_SRC_GPSR22       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09D8)))
#define MK_SRC_GPSR23       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09DC)))
#define MK_SRC_GPSR24       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09E0)))
#define MK_SRC_GPSR25       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09E4)))
#define MK_SRC_GPSR26       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09E8)))
#define MK_SRC_GPSR27       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09EC)))
#if (MK_HWMAXCORES > 3)
#define MK_SRC_GPSR30       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09F0)))
#define MK_SRC_GPSR31       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09F4)))
#define MK_SRC_GPSR32       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09F8)))
#define MK_SRC_GPSR33       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x09FC)))
#define MK_SRC_GPSR34       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A00)))
#define MK_SRC_GPSR35       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A04)))
#define MK_SRC_GPSR36       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A08)))
#define MK_SRC_GPSR37       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A0C)))
#endif /* MK_HWMAXCORES */
/* 0x0a10 to 0x0a4c are undocumented */
#define MK_SRC_ASCLIN14TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A50)))
#define MK_SRC_ASCLIN14RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A54)))
#define MK_SRC_ASCLIN14ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A58)))
#define MK_SRC_ASCLIN15TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A5C)))
#define MK_SRC_ASCLIN15RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A60)))
#define MK_SRC_ASCLIN15ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A64)))
/* 0x0a68 to 0x0a6c are undocumented */
#define MK_SRC_GTMAEIIRQ    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A70)))
#define MK_SRC_GTMARUIRQ0   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A74)))
#define MK_SRC_GTMARUIRQ1   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A78)))
#define MK_SRC_GTMARUIRQ2   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A7C)))
#define MK_SRC_GTMBRCIRQ    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A80)))
#define MK_SRC_GTMCMPIRQ    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A84)))
#define MK_SRC_GTMSPE0IRQ   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A88)))
#define MK_SRC_GTMSPE1IRQ   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A8C)))
#define MK_SRC_GTMSPE2IRQ   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A90)))
#define MK_SRC_GTMSPE3IRQ   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0A94)))
/* 0x0a98 to 0x0a9c are undocumented */
#define MK_SRC_GTMPSM00     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AA0)))
#define MK_SRC_GTMPSM01     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AA4)))
#define MK_SRC_GTMPSM02     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AA8)))
#define MK_SRC_GTMPSM03     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AAC)))
#define MK_SRC_GTMPSM04     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AB0)))
#define MK_SRC_GTMPSM05     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AB4)))
#define MK_SRC_GTMPSM06     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AB8)))
#define MK_SRC_GTMPSM07     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0ABC)))
#define MK_SRC_GTMPSM10     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AC0)))
#define MK_SRC_GTMPSM11     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AC4)))
#define MK_SRC_GTMPSM12     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AC8)))
#define MK_SRC_GTMPSM13     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0ACC)))
#define MK_SRC_GTMPSM14     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AD0)))
#define MK_SRC_GTMPSM15     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AD4)))
#define MK_SRC_GTMPSM16     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0AD8)))
#define MK_SRC_GTMPSM17     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0ADC)))
/* 0x0ae0 to 0x0afc are undocumented */
#define MK_SRC_GTMDPLL0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B00)))
#define MK_SRC_GTMDPLL1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B04)))
#define MK_SRC_GTMDPLL2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B08)))
#define MK_SRC_GTMDPLL3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B0C)))
#define MK_SRC_GTMDPLL4     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B10)))
#define MK_SRC_GTMDPLL5     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B14)))
#define MK_SRC_GTMDPLL6     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B18)))
#define MK_SRC_GTMDPLL7     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B1C)))
#define MK_SRC_GTMDPLL8     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B20)))
#define MK_SRC_GTMDPLL9     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B24)))
#define MK_SRC_GTMDPLL10    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B28)))
#define MK_SRC_GTMDPLL11    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B2C)))
#define MK_SRC_GTMDPLL12    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B30)))
#define MK_SRC_GTMDPLL13    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B34)))
#define MK_SRC_GTMDPLL14    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B38)))
#define MK_SRC_GTMDPLL15    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B3C)))
#define MK_SRC_GTMDPLL16    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B40)))
#define MK_SRC_GTMDPLL17    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B44)))
#define MK_SRC_GTMDPLL18    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B48)))
#define MK_SRC_GTMDPLL19    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B4C)))
#define MK_SRC_GTMDPLL20    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B50)))
#define MK_SRC_GTMDPLL21    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B54)))
#define MK_SRC_GTMDPLL22    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B58)))
#define MK_SRC_GTMDPLL23    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B5C)))
#define MK_SRC_GTMDPLL24    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B60)))
#define MK_SRC_GTMDPLL25    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B64)))
#define MK_SRC_GTMDPLL26    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B68)))
/* 0x0b6c is undocumented */
#define MK_SRC_GTMERR       ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B70)))
/* 0x0b74 to 0x0b8c are undocumented */
#define MK_SRC_GTMTIM00     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B90)))
#define MK_SRC_GTMTIM01     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B94)))
#define MK_SRC_GTMTIM02     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B98)))
#define MK_SRC_GTMTIM03     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0B9C)))
#define MK_SRC_GTMTIM04     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BA0)))
#define MK_SRC_GTMTIM05     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BA4)))
#define MK_SRC_GTMTIM06     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BA8)))
#define MK_SRC_GTMTIM07     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BAC)))
#define MK_SRC_GTMTIM10     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BB0)))
#define MK_SRC_GTMTIM11     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BB4)))
#define MK_SRC_GTMTIM12     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BB8)))
#define MK_SRC_GTMTIM13     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BBC)))
#define MK_SRC_GTMTIM14     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BC0)))
#define MK_SRC_GTMTIM15     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BC4)))
#define MK_SRC_GTMTIM16     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BC8)))
#define MK_SRC_GTMTIM17     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BCC)))
#define MK_SRC_GTMTIM20     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BD0)))
#define MK_SRC_GTMTIM21     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BD4)))
#define MK_SRC_GTMTIM22     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BD8)))
#define MK_SRC_GTMTIM23     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BDC)))
#define MK_SRC_GTMTIM24     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BE0)))
#define MK_SRC_GTMTIM25     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BE4)))
#define MK_SRC_GTMTIM26     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BE8)))
#define MK_SRC_GTMTIM27     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BEC)))
#define MK_SRC_GTMTIM30     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BF0)))
#define MK_SRC_GTMTIM31     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BF4)))
#define MK_SRC_GTMTIM32     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BF8)))
#define MK_SRC_GTMTIM33     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0BFC)))
#define MK_SRC_GTMTIM34     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C00)))
#define MK_SRC_GTMTIM35     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C04)))
#define MK_SRC_GTMTIM36     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C08)))
#define MK_SRC_GTMTIM37     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C0C)))
#define MK_SRC_GTMTIM40     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C10)))
#define MK_SRC_GTMTIM41     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C14)))
#define MK_SRC_GTMTIM42     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C18)))
#define MK_SRC_GTMTIM43     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C1C)))
#define MK_SRC_GTMTIM44     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C20)))
#define MK_SRC_GTMTIM45     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C24)))
#define MK_SRC_GTMTIM46     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C28)))
#define MK_SRC_GTMTIM47     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C2C)))
#define MK_SRC_GTMTIM50     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C30)))
#define MK_SRC_GTMTIM51     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C34)))
#define MK_SRC_GTMTIM52     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C38)))
#define MK_SRC_GTMTIM53     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C3C)))
#define MK_SRC_GTMTIM54     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C40)))
#define MK_SRC_GTMTIM55     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C44)))
#define MK_SRC_GTMTIM56     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C48)))
#define MK_SRC_GTMTIM57     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C4C)))
#define MK_SRC_GTMTIM60     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C50)))
#define MK_SRC_GTMTIM61     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C54)))
#define MK_SRC_GTMTIM62     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C58)))
#define MK_SRC_GTMTIM63     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C5C)))
#define MK_SRC_GTMTIM64     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C60)))
#define MK_SRC_GTMTIM65     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C64)))
#define MK_SRC_GTMTIM66     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C68)))
#define MK_SRC_GTMTIM67     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C6C)))
/* 0x0C70 to 0x0C8C are undocumented */
#define MK_SRC_ASCLIN16TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C90)))
#define MK_SRC_ASCLIN16RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C94)))
#define MK_SRC_ASCLIN16ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C98)))
#define MK_SRC_ASCLIN17TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0C9C)))
#define MK_SRC_ASCLIN17RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CA0)))
#define MK_SRC_ASCLIN17ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CA4)))
/* 0x0CA8 to 0x0CAC are undocumented */
#define MK_SRC_GTMMCS00     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CB0)))
#define MK_SRC_GTMMCS01     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CB4)))
#define MK_SRC_GTMMCS02     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CB8)))
#define MK_SRC_GTMMCS03     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CBC)))
#define MK_SRC_GTMMCS04     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CC0)))
#define MK_SRC_GTMMCS05     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CC4)))
#define MK_SRC_GTMMCS06     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CC8)))
#define MK_SRC_GTMMCS07     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CCC)))
#define MK_SRC_GTMMCS10     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CD0)))
#define MK_SRC_GTMMCS11     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CD4)))
#define MK_SRC_GTMMCS12     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CD8)))
#define MK_SRC_GTMMCS13     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CDC)))
#define MK_SRC_GTMMCS14     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CE0)))
#define MK_SRC_GTMMCS15     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CE4)))
#define MK_SRC_GTMMCS16     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CE8)))
#define MK_SRC_GTMMCS17     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CEC)))
#define MK_SRC_GTMMCS20     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CF0)))
#define MK_SRC_GTMMCS21     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CF4)))
#define MK_SRC_GTMMCS22     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CF8)))
#define MK_SRC_GTMMCS23     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0CFC)))
#define MK_SRC_GTMMCS24     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D00)))
#define MK_SRC_GTMMCS25     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D04)))
#define MK_SRC_GTMMCS26     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D08)))
#define MK_SRC_GTMMCS27     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D0C)))
