blake-mh-liu/ADCU_TC387/tresos/plugins/MicroOs_TS_T16D27M2I0R0/include/public/TRICORE/Mk_TC38X.h
#define MK_SRC_GTMMCS30     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D10)))
#define MK_SRC_GTMMCS31     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D14)))
#define MK_SRC_GTMMCS32     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D18)))
#define MK_SRC_GTMMCS33     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D1C)))
#define MK_SRC_GTMMCS34     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D20)))
#define MK_SRC_GTMMCS35     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D24)))
#define MK_SRC_GTMMCS36     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D28)))
#define MK_SRC_GTMMCS37     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D2C)))
#define MK_SRC_GTMMCS40     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D30)))
#define MK_SRC_GTMMCS41     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D34)))
#define MK_SRC_GTMMCS42     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D38)))
#define MK_SRC_GTMMCS43     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D3C)))
#define MK_SRC_GTMMCS44     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D40)))
#define MK_SRC_GTMMCS45     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D44)))
#define MK_SRC_GTMMCS46     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D48)))
#define MK_SRC_GTMMCS47     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D4C)))
#define MK_SRC_GTMMCS50     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D50)))
#define MK_SRC_GTMMCS51     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D54)))
#define MK_SRC_GTMMCS52     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D58)))
#define MK_SRC_GTMMCS53     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D5C)))
#define MK_SRC_GTMMCS54     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D60)))
#define MK_SRC_GTMMCS55     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D64)))
#define MK_SRC_GTMMCS56     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D68)))
#define MK_SRC_GTMMCS57     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D6C)))
#define MK_SRC_GTMMCS60     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D70)))
#define MK_SRC_GTMMCS61     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D74)))
#define MK_SRC_GTMMCS62     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D78)))
#define MK_SRC_GTMMCS63     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D7C)))
#define MK_SRC_GTMMCS64     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D80)))
#define MK_SRC_GTMMCS65     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D84)))
#define MK_SRC_GTMMCS66     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D88)))
#define MK_SRC_GTMMCS67     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0D8C)))
/* 0x0D90 to 0x0DEC are undocumented */
#define MK_SRC_ASCLIN18TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0DF0)))
#define MK_SRC_ASCLIN18RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0DF4)))
#define MK_SRC_ASCLIN18ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0DF8)))
#define MK_SRC_ASCLIN19TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0DFC)))
#define MK_SRC_ASCLIN19RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E00)))
#define MK_SRC_ASCLIN19ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E04)))
/* 0x0E08 to 0x0E0C are undocumented */
#define MK_SRC_GTMTOM00     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E10)))
#define MK_SRC_GTMTOM01     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E14)))
#define MK_SRC_GTMTOM02     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E18)))
#define MK_SRC_GTMTOM03     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E1C)))
#define MK_SRC_GTMTOM04     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E20)))
#define MK_SRC_GTMTOM05     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E24)))
#define MK_SRC_GTMTOM06     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E28)))
#define MK_SRC_GTMTOM07     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E2C)))
#define MK_SRC_GTMTOM10     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E30)))
#define MK_SRC_GTMTOM11     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E34)))
#define MK_SRC_GTMTOM12     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E38)))
#define MK_SRC_GTMTOM13     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E3C)))
#define MK_SRC_GTMTOM14     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E40)))
#define MK_SRC_GTMTOM15     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E44)))
#define MK_SRC_GTMTOM16     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E48)))
#define MK_SRC_GTMTOM17     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E4C)))
#define MK_SRC_GTMTOM20     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E50)))
#define MK_SRC_GTMTOM21     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E54)))
#define MK_SRC_GTMTOM22     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E58)))
#define MK_SRC_GTMTOM23     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E5C)))
#define MK_SRC_GTMTOM24     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E60)))
#define MK_SRC_GTMTOM25     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E64)))
#define MK_SRC_GTMTOM26     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E68)))
#define MK_SRC_GTMTOM27     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E6C)))
#define MK_SRC_GTMTOM30     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E70)))
#define MK_SRC_GTMTOM31     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E74)))
#define MK_SRC_GTMTOM32     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E78)))
#define MK_SRC_GTMTOM33     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E7C)))
#define MK_SRC_GTMTOM34     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E80)))
#define MK_SRC_GTMTOM35     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E84)))
#define MK_SRC_GTMTOM36     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E88)))
#define MK_SRC_GTMTOM37     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E8C)))
#define MK_SRC_GTMTOM40     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E90)))
#define MK_SRC_GTMTOM41     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E94)))
#define MK_SRC_GTMTOM42     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E98)))
#define MK_SRC_GTMTOM43     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0E9C)))
#define MK_SRC_GTMTOM44     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EA0)))
#define MK_SRC_GTMTOM45     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EA4)))
#define MK_SRC_GTMTOM46     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EA8)))
#define MK_SRC_GTMTOM47     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EAC)))
/* 0x0EB0 to 0x0ECC are undocumented */
#define MK_SRC_ASCLIN20TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0ED0)))
#define MK_SRC_ASCLIN20RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0ED4)))
#define MK_SRC_ASCLIN20ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0ED8)))
#define MK_SRC_ASCLIN21TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EDC)))
#define MK_SRC_ASCLIN21RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EE0)))
#define MK_SRC_ASCLIN21ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EE4)))
/* 0x0EE8 to 0x0EEC are undocumented */
#define MK_SRC_GTMATOM00    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EF0)))
#define MK_SRC_GTMATOM01    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EF4)))
#define MK_SRC_GTMATOM02    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EF8)))
#define MK_SRC_GTMATOM03    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0EFC)))
#define MK_SRC_GTMATOM10    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F00)))
#define MK_SRC_GTMATOM11    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F04)))
#define MK_SRC_GTMATOM12    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F08)))
#define MK_SRC_GTMATOM13    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F0C)))
#define MK_SRC_GTMATOM20    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F10)))
#define MK_SRC_GTMATOM21    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F14)))
#define MK_SRC_GTMATOM22    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F18)))
#define MK_SRC_GTMATOM23    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F1C)))
#define MK_SRC_GTMATOM30    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F20)))
#define MK_SRC_GTMATOM31    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F24)))
#define MK_SRC_GTMATOM32    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F28)))
#define MK_SRC_GTMATOM33    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F2C)))
#define MK_SRC_GTMATOM40    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F30)))
#define MK_SRC_GTMATOM41    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F34)))
#define MK_SRC_GTMATOM42    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F38)))
#define MK_SRC_GTMATOM43    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F3C)))
#define MK_SRC_GTMATOM50    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F40)))
#define MK_SRC_GTMATOM51    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F44)))
#define MK_SRC_GTMATOM52    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F48)))
#define MK_SRC_GTMATOM53    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F4C)))
#define MK_SRC_GTMATOM60    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F50)))
#define MK_SRC_GTMATOM61    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F54)))
#define MK_SRC_GTMATOM62    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F58)))
#define MK_SRC_GTMATOM63    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F5C)))
#define MK_SRC_GTMATOM70    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F60)))
#define MK_SRC_GTMATOM71    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F64)))
#define MK_SRC_GTMATOM72    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F68)))
#define MK_SRC_GTMATOM73    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F6C)))
#define MK_SRC_GTMATOM80    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F70)))
#define MK_SRC_GTMATOM81    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F74)))
#define MK_SRC_GTMATOM82    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F78)))
#define MK_SRC_GTMATOM83    ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0F7C)))
/*0x0F80 to 0x0FAC are undocumented */
#define MK_SRC_ASCLIN22TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FB0)))
#define MK_SRC_ASCLIN22RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FB4)))
#define MK_SRC_ASCLIN22ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FB8)))
#define MK_SRC_ASCLIN23TX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FBC)))
#define MK_SRC_ASCLIN23RX   ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FC0)))
#define MK_SRC_ASCLIN23ERR  ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FC4)))
/*0x0FC8 to 0x0FCC are undocumented */
#define MK_SRC_GTMMCSW0     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FD0)))
#define MK_SRC_GTMMCSW1     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FD4)))
#define MK_SRC_GTMMCSW2     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FD8)))
#define MK_SRC_GTMMCSW3     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FDC)))
#define MK_SRC_GTMMCSW4     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FE0)))
#define MK_SRC_GTMMCSW5     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FE4)))
#define MK_SRC_GTMMCSW6     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FE8)))
#define MK_SRC_GTMMCSW7     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FEC)))
#define MK_SRC_GTMMCSW8     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FF0)))
#define MK_SRC_GTMMCSW9     ((mk_reg32_t *)(MK_SRCBASE+MK_U(0x0FF4)))

#endif /* MK_TC38X_H */

/* Editor settings: DO NOT DELETE
 * vi: set ts=4:
*/
